{
  "authentication": "To authenticate with CapillaryTech APIs, use your till ID and an MD5-hashed password in Basic Auth headers.",
  "create_company": "To add a company, make a POST request to /v2/companies with company details in JSON format.",
  "api_format": "CapillaryTech APIs accept and return data in JSON. They follow REST principles.",
  "asia": "For Connecting with asia API Server Use this route :https://apac.api.capillarytech.com",
  "hello": "😊 Hey! 👋 What's up? Need to know about Cloud Computing?",
  "yes": "Cloud computing is the delivery of computing services over the internet, or the cloud",
  "cloud computing": "Cloud computing is the delivery of computing services over the internet, or the cloud",
  "ok": "Cool! 😄 If you run into anything, please feel free to contact me 🚀",
  "thanks": "You're very welcome! 😄 Glad it's working now. If you need any help, feel free to contact me.",
  "loyalty": "Loyalty+ is a platform that helps you incentivize your customers on the basis of their enrollment and engagement in the form of coupons and points. It lets you influence your customer lifecycle by rewarding them for different activities including transactions, and profile updates.\n\nThrough effective loyalty programs, you can motivate your customers to become more loyal and increase repeat transactions. Loyalty+ helps you treat your customers differently, track their behavior, monitor their interactions, and incentivize them accordingly, creating genuine connections.\n\nWith Loyalty+, you can grade your customers with loyalty tiers and depending on their purchase value and incentivize them separately by providing better benefits to highly loyal customers. It upsurges customer engagement with your brand and drives their interactions. The embedded rule sets with an expression editor provide complete flexibility in creating simple to any complex conditions that you want to evaluate to trigger an action. You can perform several actions such as activity-based tier upgrade, points allocation, communication, issue coupon, renew tier, issue points to referrer or referee, and more.\n\nLoyalty programs are beneficial to both customers and brands as they not only provide benefits to customers but also build relationships with them.",
  "engage": "Capillary Engage+ is a marketing automation solution that helps to create significant and personalized multi-channel marketing campaigns. You can create a campaign for different marketing objectives, such as Sales promotion, New Store openings, Brand anniversaries, Birthdays, and many others.\n\nEngage+ lets you reach out to your customers over direct channels such as email, SMS, WhatsApp, and Line and social media channels such as Facebook. You can also trigger messages to InStore outlets. It is equipped with AI-powered filters for more personalized and smart targeting.",
  "insights": "What is Insights+ and how can you leverage it?\nCapillary’s Insights+ is an effective business intelligence tool that offers a 360-degree analysis of an organization's business data. With Insights+ capabilities you can measure metrics such as the revenue impact of your marketing campaigns, loyalty program and much more to effortlessly optimize future performance.\n\nLeveraging such insights can:\n- Help you drive product innovation.\n- Track and improve the impact of product launches in real-time.\n- Accelerate business outcomes across the lifecycle.\n- Drive loyalty\n- Make smart, quick and informed decisions with data-driven insights.\n\nWhere does Insights+ lie with respect to Loyalty+, Engage+ and CDP?\nInsights+ essentially consumes data from your Loyalty+, Engage+ and CDP platforms to magically transform it into useful data insights. Further, it provides multiple capabilities for you to visualize and analyze your data effectively so that you can take smart, quick and informed decisions to optimize your business performance.",
  "advance": "What are the advanced features that Insights+ provides?\n\nApart from reports, Insights+ provides advanced capabilities such as Customer Segmentation and Data Exports.\n\nCustomer Segmentation:\nWith the Customer Segmentation feature, you can segment the customers based on their behavior and demographics. Analytics on these segments will help you to understand the customer’s behavior better and subsequently make more effective business decisions in terms of pricing, offers and retention strategies. An excellent example of the same is RFM segmentation.\n\nData Exports:\nData Export helps you export the CRM data available in Capillary's system to an FTP location or internal server. You can export data related to customers, transactions, coupons, points, Footfall, and campaigns. You can create an export job using templates. Each template is a combination of either KPIs or facts, and dimensions.",
  "data": "Member Care helps you manage your customer database in an efficient manner and resolve customer issues. It helps you take data-driven decisions using a complete data toolkit.\n\nMember Care is a web application that lets you manage and view customer accounts, goodwill requests, identifier change requests, and tickets. You can also view customer activities, behavioral events, and interactions.",
  "API_Version": "Capillary's APIs are divided into four versions:\n\n- v1\n- v1.1\n- v2\n- v3\n\nThese versions are not merely upgrades; they are a combination of:\n- new sets of APIs that receive new version numbers, and\n- upgraded versions of existing APIs.\n\nThe v1 APIs support both JSON and XML. The v2 and v3 APIs are developed in JSON.\n\n**Additional features of v2 and v3 APIs:**\n- Provide extended support for multiple sources, i.e., you can now manage accounts of different sources such as InStore, MartJack, WeChat, e-commerce and Facebook.\n- Support multiple accounts of a single source. For example, an org could have multiple accounts on WeChat and Facebook. Each account will have a different account ID. You would need to pass the respective account ID when making API calls.\n- Merge accounts automatically when the same identifier is registered in different sources. For example, assume that a customer has registered on InStore using their mobile number and on the e-commerce site using their email ID. Now, if the customer registers the same mobile number on the e-commerce site, the accounts will be merged automatically to a single customer ID. You can retrieve the customer details from various sources of an organization using the unique customer ID.\n\n*NOTE:* By default, all the API versions are enabled for the organisations across clusters.\n\n**Tracking Request:**\nA unique ID is generated for every request made using Capillary APIs and is sent to the requester in the Response Headers as `X-Cap-Requestid`. You can use this request ID to track the request end-to-end. It is recommended to note the `X-Cap-Requestid` of a request for future requirements.",
  "http": "Overview:\nThis page gives you the overview of Capillary APIs.\n\nCapillary APIs are structured following the REST model. Our APIs use HTTPS protocol and support requests and responses in JSON format.\n\nHTTP methods:\nThe HTTP methods used in Capillary APIs are as follows:\n\n- POST: To create a new resource.\n- PUT: To update an existing resource.\n- GET: To retrieve a resource.\n- DELETE: To delete a resource.\n- PATCH: To partially update an existing resource.\n\nKnow about API URL structure, host URL and headers:\nAPI URL structure...",
  "sdk": "Capillary SDK enables you with essential analytics capabilities and helps you engage better with your users through events tracking, push notifications and a notification center.\n\n**Prerequisites:**\n- Android SDK version V21 or above\n- targetSdkVersion 33\n- compileSdkVersion 33\n- Google Firebase account\n\n**Android SDK Size:**\n| SDK library             | Size  |\n|------------------------|-------|\n| hydra-core-1.0.1       | 258 KB|\n| hydra-firebase-1.0.1   | 26 KB |\n| hydra-pushbase-1.0.1   | 83 KB |\n\n**To integrate your mobile apps with Capillary Android SDK, perform the below steps:**\n1. Configure Firebase and gateway - Capillary mobile apps team\n2. Set up source account - CSM/ Project Manager of the project\n3. Install the SDK\n4. Initialise the SDK\n5. Set up events tracking\n6. Configure push notification"
}
